// Задача 56: Задайте прямоугольный двумерный массив. Напишите программу, 
// которая будет находить строку с наименьшей суммой элементов.

// Например, задан массив:
// 1 4 7 2
// 5 9 2 3
// 8 4 2 4
// 5 2 6 7

// Программа считает сумму элементов в каждой строке и выдаёт 
// номер строки с наименьшей суммой элементов: 1 строка


Console.WriteLine("Введите количество строк: ");
int rows = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите количество столбцов: ");
int columns = Convert.ToInt32(Console.ReadLine());

int temp = int.MaxValue;
int sum = 0;
int k = 0;
int [,] matrix = new int[rows, columns];



for (int i = 0; i < matrix.GetLength(0); i++)
{
    for (int j = 0; j < matrix.GetLength(1); j++)
    {
        matrix[i,j] = new Random().Next(-30,31);
        Console.Write(matrix[i,j]+"\t");

    }
    Console.WriteLine();
}
Console.WriteLine();

for (int i = 0; i < matrix.GetLength(0); i++)
{
    sum = 0;
    for (int j = 0; j < matrix.GetLength(1); j++)
    {
        sum += matrix[i,j];
            

    }
            
    Console.WriteLine("Сумма элементов строки = " + sum);

    if(temp>sum)
    {
        temp = sum;
        k = i;
    }


}
Console.WriteLine($"Номер строки с наименьшей суммой =  {k+1}");


